""" 15-6. Автоматические метки: измените программы die.py и dice_visual.py. Замените список,
используемый для задания значений hist.x_labels, циклом, автоматически генерирующим
этот список. Если вы хорошо освоили генераторы списков, также попробуйте заменить
другие циклы for в die_visual.py и dice_visual.py генераторами спискоv """
#Done
""" 15-7. Два кубика D8s: создайте модель, которая показывает, что происходит при 1000-крат-
ном бросании двух восьмигранных кубиков. Постепенно наращивайте количество бросков,
пока не начнете замечать ограничения, связанные с ресурсами вашей системы. """
#Done
""" 15-8. Три кубика: при броске 3 кубиков D6 наименьший возможный результат равен 3,
а наибольший — 18. Создайте визуализацию, которая показывает, что происходит при бро-
ске трех кубиков D6 """
#Done
""" 15-9. Умножение: при броске двух кубиков результат обычно определяется суммированием
двух чисел. Создайте визуализацию, которая показывает, что происходит при умножении
этих чисел. """
#Done
""" 15-10. Эксперименты с библиотеками: попробуйте использовать matplotlib для создания ви-
зуализации бросков кубиков, а Pygal — для создания визуализации случайного блуждания. """
#For future